import os

APP_ENV = os.environ.get('APP_ENV')

# --------------------------------------------------------------------------------
#                        GENERAL SETTINGS
# --------------------------------------------------------------------------------
SUPPLIERS_DATA_TABLE_NAME = 'suppliers_data'  # таблица для хранения остатков и цен поставщиков
SUPPLIERS_DATA_TABLE_NAME_PARTITION = 'offer_id, supplier_id, date'  # столбцы по которым удаляются дупликаты в БД
# STOCKS_API_URL = 'http://localhost:5000/stocks'  # URL метода для записи остатков (API stocks)

# --------------------------------------------------------------------------------
#                        DEVELOPMENT SETTINGS
# --------------------------------------------------------------------------------
if APP_ENV == 'development':
    pass

# --------------------------------------------------------------------------------
#                            TESTING SETTINGS (заполнение таблиц на сервере с локального компьютера)
# --------------------------------------------------------------------------------
if APP_ENV == 'testing':
    pass

# --------------------------------------------------------------------------------
#                            PRODUCTION SETTINGS
# --------------------------------------------------------------------------------
if APP_ENV == 'production':
    pass
