import os

APP_ENV = os.environ.get('APP_ENV')

# --------------------------------------------------------------------------------
#                        GENERAL SETTINGS
# --------------------------------------------------------------------------------

# максимальное кол-во товаров можно отправлть в одном запросе
MAX_NUMBER_OF_PRODUCTS = 10000
# максимальное кол-во аккаунтов, которое можно обновить в одном запросе
MAX_NUMBER_OF_ACCOUNTS = 10
# сколько товаров можно в одном запросе отправлять на площадки
NUMBER_OF_PRODUCTS_TO_PROCESS = 100

# --------------------------------------------------------------------------------
#                        DEVELOPMENT SETTINGS
# --------------------------------------------------------------------------------

if APP_ENV == 'development':

    SLEEP_TIME = 3  # время между запросами в API маркетплейсов (сек)
    TEST_ACCOUNTS = []
    PRINT_DB_INSERTS = True  # выводить на печать таблицы в БД и кол-во добавленных записей

# --------------------------------------------------------------------------------
#                            TESTING SETTINGS (заполнение таблиц на сервере с локального компьютера)
# --------------------------------------------------------------------------------

if APP_ENV == 'testing':

    SLEEP_TIME = 0  # время между запросами в API маркетплейсов (сек)
    TEST_ACCOUNTS = []  # номера аккаунтов для тестирования в таблице account_list (market_db), например, [1, 2, 3]
    PRINT_DB_INSERTS = True  # выводить на печать таблицы в БД и кол-во добавленных записей

# --------------------------------------------------------------------------------
#                            PRODUCTION SETTINGS
# --------------------------------------------------------------------------------

if APP_ENV == 'production':

    SLEEP_TIME = 0  # время между запросами в API маркетплейсов (сек)
    TEST_ACCOUNTS = []  # номера аккаунтов для тестирования в таблице account_list (market_db), например, [1, 2, 3]
    PRINT_DB_INSERTS = False  # выводить на печать таблицы в БД и кол-во добавленных записей
